tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/cask"
tap "neomutt/neomutt"
tap "nativeos/i386-elf-toolchain"
brew "bash"
brew "bash-completion"
brew "cargo-completion"
brew "curl"
brew "django-completion"
brew "docker-completion"
brew "docker-compose-completion"
brew "erlang"
brew "elixir"
brew "go"
brew "mix-completion"
brew "neovim"
brew "node"
brew "pandoc"
brew "pip-completion"
brew "python"
brew "python3"
brew "rails-completion"
brew "rake-completion"
brew "rust"
brew "rustc-completion"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "wget"
brew "nativeos/i386-elf-toolchain/i386-elf-gcc"
brew "nativeos/i386-elf-toolchain/i386-elf-gdb"
brew "neomutt/neomutt/neomutt"
cask "anki"
cask "appcleaner"
cask "au-lab"
cask "avibrazil-rdm"
cask "basictex"
cask "discord"
cask "docker"
cask "firefox"
cask "gimp"
cask "gpgtools"
cask "keepassxc"
cask "keybase"
cask "macdown"
cask "screenflow"
cask "steam"
cask "transmission"
cask "vagrant"
cask "veracrypt"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatpulse"
